// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//
//      新核科技(广州)有限公司
//
//      Copyright (C) 2022 CoreKernel Technology Guangzhou Co., Ltd
//
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//
//      GPIO LED 直接寄存器配置
//
//      2022年04月26日
//
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
/*
 *    直接配置 GPIO 寄存器
 *
 *    - 希望缄默(bin wang)
 *    - bin@corekernel.net
 *
 *    官网 corekernel.net/.org/.cn
 *    社区 fpga.net.cn
 *
 */

// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//
//      宏定义
//
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#define HWREG(x)              (*((volatile unsigned int *)(x)))

// 寄存器
#define SYSCFG_PINMUX13_REG   (0x01C14154)
#define GPIO_DIR67_REG        (0x01E26000 + 0x88)
#define GPIO_OUT_DATA67_REG   (0x01E26000 + 0x8C)

// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//
//      延时（非精确）
//
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
static void Delay(volatile unsigned int delay)
{
    while(delay--);
}

// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//
//      主函数
//
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
void main()
{
    // 管脚复用配置
    HWREG(SYSCFG_PINMUX13_REG) = (HWREG(SYSCFG_PINMUX13_REG) & ~(0xFu << 28)) | ((8u << 8) | (8u << 12));

    // GPIO 管脚初始化
    HWREG(GPIO_DIR67_REG) = (HWREG(GPIO_DIR67_REG) & ~((1 << 12) | 1 << 13));

    for(;;)
    {
        // 延时(非精确)
        Delay(0x00FFFFFF);
        HWREG(GPIO_OUT_DATA67_REG) = (HWREG(GPIO_OUT_DATA67_REG) & ~((1 << 12) | 1 << 13));

        // 延时(非精确)
        Delay(0x00FFFFFF);
        HWREG(GPIO_OUT_DATA67_REG) = (HWREG(GPIO_OUT_DATA67_REG) | ((1 << 12) | 1 << 13));
    }
}
