; ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
;
;      新核科技(广州)有限公司
;
;      Copyright (C) 2022 CoreKernel Technology Guangzhou Co., Ltd
;
; ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
; ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
;
;      软件延时
;
;      2022年04月26日
;
; ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
;
;    - 希望缄默(bin wang)
;    - bin@corekernel.net
;
;    官网 corekernel.net/.org/.cn
;    社区 fpga.net.cn
;
    .sect		".text"
    .global		Delay

; 延时函数
Delay:
        MV		.L2     A4, B0
||      SUB		.L1     A4, 1, A4
|| [B0] B		.S1     Delay
        NOP		5
